{"class_name": "Model", "keras_version": "1.1.0", "config": {"layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 784], "input_dtype": "float32", "sparse": false, "name": "input_7"}, "inbound_nodes": [], "name": "input_7"}, {"class_name": "Dense", "config": {"W_constraint": null, "b_constraint": null, "name": "dense_7", "activity_regularizer": null, "trainable": true, "init": "glorot_uniform", "bias": true, "input_dim": null, "b_regularizer": null, "W_regularizer": null, "activation": "sigmoid", "output_dim": 32}, "inbound_nodes": [[["input_7", 0, 0]]], "name": "dense_7"}, {"class_name": "Dense", "config": {"W_constraint": null, "b_constraint": null, "name": "dense_8", "activity_regularizer": null, "trainable": true, "init": "glorot_uniform", "bias": true, "input_dim": null, "b_regularizer": null, "W_regularizer": null, "activation": "sigmoid", "output_dim": 784}, "inbound_nodes": [[["dense_7", 0, 0]]], "name": "dense_8"}], "input_layers": [["input_7", 0, 0]], "output_layers": [["dense_8", 0, 0]], "name": "model_10"}}