{"class_name": "Model", "keras_version": "1.1.0", "config": {"layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 784], "input_dtype": "float32", "sparse": false, "name": "input_9"}, "inbound_nodes": [], "name": "input_9"}, {"class_name": "Dense", "config": {"W_constraint": null, "b_constraint": null, "name": "dense_9", "activity_regularizer": null, "trainable": true, "init": "glorot_uniform", "bias": true, "input_dim": null, "b_regularizer": null, "W_regularizer": null, "activation": "sigmoid", "output_dim": 32}, "inbound_nodes": [[["input_9", 0, 0]]], "name": "dense_9"}, {"class_name": "Dense", "config": {"W_constraint": null, "b_constraint": null, "name": "dense_10", "activity_regularizer": null, "trainable": true, "init": "glorot_uniform", "bias": true, "input_dim": null, "b_regularizer": null, "W_regularizer": null, "activation": "sigmoid", "output_dim": 784}, "inbound_nodes": [[["dense_9", 0, 0]]], "name": "dense_10"}], "input_layers": [["input_9", 0, 0]], "output_layers": [["dense_10", 0, 0]], "name": "model_13"}}